Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


########################################################################################################################
# Vulintus HabiTrak V1.0 (SAMD51P19A)
# ------------------------------

vulintus_habitrak_v1_0.name=Vulintus HabiTrak V1.0 (SAMD51P19A)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4325, submitted by Drew on 2/2/2022
vulintus_habitrak_v1_0.vid.0=0x04D8
vulintus_habitrak_v1_0.pid.0=0xE6AC
vulintus_habitrak_v1_0.build.vid=0x04D8
vulintus_habitrak_v1_0.build.pid=0xE6AC

# Upload
vulintus_habitrak_v1_0.upload.maximum_size=520192
vulintus_habitrak_v1_0.upload.native_usb=true
vulintus_habitrak_v1_0.upload.offset=0x4000
vulintus_habitrak_v1_0.upload.protocol=sam-ba
vulintus_habitrak_v1_0.upload.tool=bossac18
vulintus_habitrak_v1_0.upload.use_1200bps_touch=true
vulintus_habitrak_v1_0.upload.wait_for_upload_port=true

# Build
vulintus_habitrak_v1_0.build.board=HABITRAK_V1_0
vulintus_habitrak_v1_0.build.cache_flags=-DENABLE_CACHE
vulintus_habitrak_v1_0.build.core=arduino
vulintus_habitrak_v1_0.build.extra_flags=-D__SAMD51P19A__ -DVULINTUS_HABITRAK_V1_0 -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak_v1_0.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
vulintus_habitrak_v1_0.build.flags.optimize=-Os
vulintus_habitrak_v1_0.build.f_cpu=120000000L
vulintus_habitrak_v1_0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_habitrak_v1_0.build.mcu=cortex-m4
vulintus_habitrak_v1_0.build.openocdscript=openocd_scripts/habitrak_v1_0.cfg
vulintus_habitrak_v1_0.build.usb_product="Vulintus HabiTrak V1.0"
vulintus_habitrak_v1_0.build.usb_manufacturer="Vulintus Inc"
vulintus_habitrak_v1_0.build.variant=habitrak_v1_0
vulintus_habitrak_v1_0.build.variant_system_lib=

# Bootloader
vulintus_habitrak_v1_0.bootloader.file=habitrak_v1_x/bootloader-vulintus_habitrak_v1-v3.14.0-5-g779ccde-dirty.bin
vulintus_habitrak_v1_0.bootloader.tool=openocd

# Compiler
vulintus_habitrak_v1_0.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

#Parameter options formerly set with the menu:
# vulintus_habitrak_v1_0.build.cache_flags=-DENABLE_CACHE
# vulintus_habitrak_v1_0.build.cache_flags=
# vulintus_habitrak_v1_0.build.flags.debug=-g
# vulintus_habitrak_v1_0.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
# vulintus_habitrak_v1_0.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
# vulintus_habitrak_v1_0.build.flags.optimize=-Os
# vulintus_habitrak_v1_0.build.flags.optimize=-O2
# vulintus_habitrak_v1_0.build.flags.optimize=-O3
# vulintus_habitrak_v1_0.build.flags.optimize=-Ofast
# vulintus_habitrak_v1_0.build.flags.optimize=-Ofast -funroll-loops
# vulintus_habitrak_v1_0.build.flags.usbstack=-DUSE_TINYUSB
# vulintus_habitrak_v1_0.build.f_cpu=120000000L
# vulintus_habitrak_v1_0.build.f_cpu=150000000L
# vulintus_habitrak_v1_0.build.f_cpu=180000000L
# vulintus_habitrak_v1_0.build.f_cpu=200000000L


########################################################################################################################
# Vulintus HabiTrak V1.1 (SAMD51P19A)
# ------------------------------

vulintus_habitrak_v1_1.name=Vulintus HabiTrak V1.1 (SAMD51P19A)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4290, submitted by Drew on 1/13/2022
vulintus_habitrak_v1_1.vid.0=0x04D8    
vulintus_habitrak_v1_1.pid.0=0xE6C2    
vulintus_habitrak_v1_1.build.vid=0x04D8
vulintus_habitrak_v1_1.build.pid=0xE6C2

# Upload
vulintus_habitrak_v1_1.upload.maximum_size=520192
vulintus_habitrak_v1_1.upload.native_usb=true
vulintus_habitrak_v1_1.upload.offset=0x4000
vulintus_habitrak_v1_1.upload.protocol=sam-ba
vulintus_habitrak_v1_1.upload.tool=bossac18
vulintus_habitrak_v1_1.upload.use_1200bps_touch=true
vulintus_habitrak_v1_1.upload.wait_for_upload_port=true

# Build
vulintus_habitrak_v1_1.build.board=HABITRAK_V1_1
vulintus_habitrak_v1_1.build.cache_flags=-DENABLE_CACHE
vulintus_habitrak_v1_1.build.core=arduino
vulintus_habitrak_v1_1.build.extra_flags=-D__SAMD51P19A__ -DVULINTUS_HABITRAK_V1_1 -D__SAMD51__ {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak_v1_1.build.flags.optimize=-Os
vulintus_habitrak_v1_1.build.f_cpu=120000000L
vulintus_habitrak_v1_1.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_habitrak_v1_1.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
vulintus_habitrak_v1_1.build.mcu=cortex-m4
vulintus_habitrak_v1_1.build.openocdscript=openocd_scripts/habitrak_v1_1.cfg
vulintus_habitrak_v1_1.build.usb_manufacturer="Vulintus Inc"
vulintus_habitrak_v1_1.build.usb_product="Vulintus HabiTrak V1.1"
vulintus_habitrak_v1_1.build.variant=habitrak_v1_1
vulintus_habitrak_v1_1.build.variant_system_lib=

# Bootloader
vulintus_habitrak_v1_1.bootloader.file=habitrak_v1_x/bootloader-vulintus_habitrak_v1-v3.14.0-5-g779ccde-dirty.bin
vulintus_habitrak_v1_1.bootloader.tool=openocd

# Compiler
vulintus_habitrak_v1_1.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

