Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
#Parameter options formerly set with the menu:
# vulintus_habitrak_v1_1.build.cache_flags=-DENABLE_CACHE
# vulintus_habitrak_v1_1.build.cache_flags=
# vulintus_habitrak_v1_1.build.flags.debug=-g
# vulintus_habitrak_v1_1.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
# vulintus_habitrak_v1_1.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
# vulintus_habitrak_v1_1.build.flags.optimize=-Os
# vulintus_habitrak_v1_1.build.flags.optimize=-O2
# vulintus_habitrak_v1_1.build.flags.optimize=-O3
# vulintus_habitrak_v1_1.build.flags.optimize=-Ofast
# vulintus_habitrak_v1_1.build.flags.optimize=-Ofast -funroll-loops
# vulintus_habitrak_v1_1.build.flags.usbstack=-DUSE_TINYUSB
# vulintus_habitrak_v1_1.build.f_cpu=120000000L
# vulintus_habitrak_v1_1.build.f_cpu=150000000L
# vulintus_habitrak_v1_1.build.f_cpu=180000000L
# vulintus_habitrak_v1_1.build.f_cpu=200000000L


########################################################################################################################
# Vulintus OmniTrak Controller V2.0 (SAMD51P20A)
# ------------------------------

vulintus_omnitrak_controller_v2_0.name=Vulintus OmniTrak Controller V2.0 (SAMD51P20A)

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4289, submitted by Drew on 1/13/2022
vulintus_omnitrak_controller_v2_0.vid.0=0x04D8    
vulintus_omnitrak_controller_v2_0.pid.0=0xE6C3    
vulintus_omnitrak_controller_v2_0.build.vid=0x04D8
vulintus_omnitrak_controller_v2_0.build.pid=0xE6C3

# Upload
vulintus_omnitrak_controller_v2_0.upload.offset=0x4000
vulintus_omnitrak_controller_v2_0.upload.protocol=sam-ba
vulintus_omnitrak_controller_v2_0.upload.maximum_size=1032192
vulintus_omnitrak_controller_v2_0.upload.tool=bossac18
vulintus_omnitrak_controller_v2_0.upload.use_1200bps_touch=true
vulintus_omnitrak_controller_v2_0.upload.wait_for_upload_port=true
vulintus_omnitrak_controller_v2_0.upload.native_usb=true

# Build
vulintus_omnitrak_controller_v2_0.build.board=OMNITRAK_CONTROLLER_V2_0
vulintus_omnitrak_controller_v2_0.build.cache_flags=-DENABLE_CACHE
vulintus_omnitrak_controller_v2_0.build.core=arduino
vulintus_omnitrak_controller_v2_0.build.extra_flags=-D__SAMD51P20A__ -DVULINTUS_OMNITRAK_CONTROLLER_V2_0 -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
vulintus_omnitrak_controller_v2_0.build.flags.optimize=-Os
vulintus_omnitrak_controller_v2_0.build.f_cpu=120000000L
vulintus_omnitrak_controller_v2_0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_omnitrak_controller_v2_0.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
vulintus_omnitrak_controller_v2_0.build.mcu=cortex-m4
vulintus_omnitrak_controller_v2_0.build.openocdscript=openocd_scripts/omnitrak_controller_v2_0.cfg
vulintus_omnitrak_controller_v2_0.build.usb_product="Vulintus OmniTrak Controller V2.0"
vulintus_omnitrak_controller_v2_0.build.usb_manufacturer="Vulintus Inc"
vulintus_omnitrak_controller_v2_0.build.variant=omnitrak_controller_v2_0
vulintus_omnitrak_controller_v2_0.build.variant_system_lib=

# Bootloader
vulintus_omnitrak_controller_v2_0.bootloader.tool=openocd
vulintus_omnitrak_controller_v2_0.bootloader.file=omnitrak_controller_v2_0/bootloader-omnitrak_controller_v2_0.bin

# Compiler
vulintus_omnitrak_controller_v2_0.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

#Parameter options formerly set with the menu:
# vulintus_omnitrak_controller_v2_0.build.cache_flags=-DENABLE_CACHE
# vulintus_omnitrak_controller_v2_0.build.cache_flags=
# vulintus_omnitrak_controller_v2_0.build.flags.debug=-g
# vulintus_omnitrak_controller_v2_0.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
# vulintus_omnitrak_controller_v2_0.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
# vulintus_omnitrak_controller_v2_0.build.flags.optimize=-Os
# vulintus_omnitrak_controller_v2_0.build.flags.optimize=-O2
# vulintus_omnitrak_controller_v2_0.build.flags.optimize=-O3
# vulintus_omnitrak_controller_v2_0.build.flags.optimize=-Ofast
# vulintus_omnitrak_controller_v2_0.build.flags.optimize=-Ofast -funroll-loops
# vulintus_omnitrak_controller_v2_0.build.flags.usbstack=-DUSE_TINYUSB
# vulintus_omnitrak_controller_v2_0.build.f_cpu=120000000L
# vulintus_omnitrak_controller_v2_0.build.f_cpu=150000000L
# vulintus_omnitrak_controller_v2_0.build.f_cpu=180000000L
# vulintus_omnitrak_controller_v2_0.build.f_cpu=200000000L


########################################################################################################################
# Vulintus Linear Autopositioner V2.1 (SAMD21G17A)
# ------------------------------

vulintus_linear_autopositioner_v2_1.name=Vulintus Linear Autopositioner V2.1 (SAMD21G17A)

# VID/PID for Bootloader, Arduino & CircuitPython
vulintus_linear_autopositioner_v2_1.vid.0=0x239A
vulintus_linear_autopositioner_v2_1.pid.0=0x8013
vulintus_linear_autopositioner_v2_1.vid.1=0x239A
vulintus_linear_autopositioner_v2_1.pid.1=0x0013

# Upload
vulintus_linear_autopositioner_v2_1.upload.tool=bossac18
vulintus_linear_autopositioner_v2_1.upload.protocol=sam-ba
vulintus_linear_autopositioner_v2_1.upload.maximum_size=122880
vulintus_linear_autopositioner_v2_1.upload.offset=0x2000
vulintus_linear_autopositioner_v2_1.upload.use_1200bps_touch=true
vulintus_linear_autopositioner_v2_1.upload.wait_for_upload_port=true
vulintus_linear_autopositioner_v2_1.upload.native_usb=true

# Build
vulintus_linear_autopositioner_v2_1.build.mcu=cortex-m0plus
vulintus_linear_autopositioner_v2_1.build.f_cpu=48000000L
vulintus_linear_autopositioner_v2_1.build.cache_flags=-DENABLE_CACHE
vulintus_linear_autopositioner_v2_1.build.flags.optimize=-Os
vulintus_linear_autopositioner_v2_1.build.usb_product="Vulintus Linear Autopositioner V2.0"
vulintus_linear_autopositioner_v2_1.build.usb_manufacturer="Vulintus Inc"
vulintus_linear_autopositioner_v2_1.build.board=LINEAR_AUTOPOSITIONER_V2_1
vulintus_linear_autopositioner_v2_1.build.core=arduino
vulintus_linear_autopositioner_v2_1.build.extra_flags=-D__SAMD21G17A__ -DVULINTUS_LINEAR_AUTOPOSITIONER_V2_1 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vulintus_linear_autopositioner_v2_1.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_linear_autopositioner_v2_1.build.openocdscript=openocd_scripts/linear_autopositioner_v2_1.cfg
vulintus_linear_autopositioner_v2_1.build.variant=linear_autopositioner_v2_1
vulintus_linear_autopositioner_v2_1.build.variant_system_lib=
vulintus_linear_autopositioner_v2_1.build.vid=0x239A
vulintus_linear_autopositioner_v2_1.build.pid=0x8013

# Bootloader
vulintus_linear_autopositioner_v2_1.bootloader.tool=openocd
vulintus_linear_autopositioner_v2_1.bootloader.file=linear_autopositioner_v2_1/bootloader-linear_autopositioner_v2_1.bin


########################################################################################################################
# Vulintus Liquid Dispenser V2.0 (SAMD21G17A)
# ------------------------------

vulintus_liquid_dispenser_v2_0.name=Vulintus Liquid Dispenser V2.0 (SAMD21G17A)

# VID/PID for Bootloader, Arduino & CircuitPython
vulintus_liquid_dispenser_v2_0.vid.0=0x2341
vulintus_liquid_dispenser_v2_0.pid.0=0x804d
vulintus_liquid_dispenser_v2_0.vid.1=0x2341
vulintus_liquid_dispenser_v2_0.pid.1=0x804d

# Upload
vulintus_liquid_dispenser_v2_0.upload.tool=bossac18
vulintus_liquid_dispenser_v2_0.upload.protocol=sam-ba
vulintus_liquid_dispenser_v2_0.upload.maximum_size=122880
vulintus_liquid_dispenser_v2_0.upload.maximum_data_size=16384
vulintus_liquid_dispenser_v2_0.upload.offset=0x2000
vulintus_liquid_dispenser_v2_0.upload.use_1200bps_touch=true
vulintus_liquid_dispenser_v2_0.upload.wait_for_upload_port=true
vulintus_liquid_dispenser_v2_0.upload.native_usb=true

# Build
vulintus_liquid_dispenser_v2_0.build.mcu=cortex-m0plus
vulintus_liquid_dispenser_v2_0.build.f_cpu=48000000L
vulintus_liquid_dispenser_v2_0.build.cache_flags=-DENABLE_CACHE
vulintus_liquid_dispenser_v2_0.build.flags.optimize=-Os
vulintus_liquid_dispenser_v2_0.build.usb_product="Vulintus Liquid Dispenser V2.0"
vulintus_liquid_dispenser_v2_0.build.usb_manufacturer="Vulintus Inc"
vulintus_liquid_dispenser_v2_0.build.board=LIQUID_DISPENSER_V2_0
vulintus_liquid_dispenser_v2_0.build.core=arduino
vulintus_liquid_dispenser_v2_0.build.extra_flags=-DCRYSTALLESS -D__SAMD21G17A__ -DVULINTUS_LIQUID_DISPENSER_V2_0 -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vulintus_liquid_dispenser_v2_0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_liquid_dispenser_v2_0.build.openocdscript=openocd_scripts/liquid_dispenser_v2_0.cfg
vulintus_liquid_dispenser_v2_0.build.variant=liquid_dispenser_v2_0
vulintus_liquid_dispenser_v2_0.build.variant_system_lib=
vulintus_liquid_dispenser_v2_0.build.vid=0x2341
vulintus_liquid_dispenser_v2_0.build.pid=0x804d

# Bootloader
vulintus_liquid_dispenser_v2_0.bootloader.tool=openocd
vulintus_liquid_dispenser_v2_0.bootloader.file=liquid_dispenser_v2_0/samd21g17a_sam_ba.bin


########################################################################################################################
# Vulintus Cage Ring Light V2.0 (SAMD11C14A)
# ------------------------------

